In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")

In [3]:
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [4]:
df_new = df[['OdName', 'AreaName', 1980]]

In [6]:
df_new = df_new.head()

In [7]:
df_new

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

# Set a Column as an Index

In [8]:
df_1 = df_new.set_index('OdName')

In [9]:
df_1

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0

Name of the Index

In [10]:
df_1.index.name

'OdName'

Index Values

In [12]:
df_1.index.values

array(['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra'],
      dtype=object)

In [14]:
"Albania" in df_1.index.values

True

Set Current Index column as an regular column of DataFrame

In [18]:
df_1.reset_index(inplace=True)

In [19]:
df_1

           OdName AreaName  1980
0     Afghanistan     Asia    16
1         Albania   Europe     1
2         Algeria   Africa    80
3  American Samoa  Oceania     0
4         Andorra   Europe     0

In [20]:
df_1 = df_1.set_index("AreaName")

In [21]:
df_1

                  OdName  1980
AreaName
Asia         Afghanistan    16
Europe           Albania     1
Africa           Algeria    80
Oceania   American Samoa     0
Europe           Andorra     0

Reset Index (index value 0 .. n) but don't add previous Index column in DataFrame

In [22]:
df_1.reset_index(drop=True, inplace=True)

In [23]:
df_1

           OdName  1980
0     Afghanistan    16
1         Albania     1
2         Algeria    80
3  American Samoa     0
4         Andorra     0

In [25]:
df_1.reset_index(inplace=True)   #Current index will be added into dataframe as a regular index

In [26]:
df_1

   index          OdName  1980
0      0     Afghanistan    16
1      1         Albania     1
2      2         Algeria    80
3      3  American Samoa     0
4      4         Andorra     0

In [27]:
df_1.reset_index(inplace=True)

In [28]:
df_1

   level_0  index          OdName  1980
0        0      0     Afghanistan    16
1        1      1         Albania     1
2        2      2         Algeria    80
3        3      3  American Samoa     0
4        4      4         Andorra     0

In [29]:
df_1.reset_index(inplace=True)

ValueError: cannot insert level_0, already exists